Repository: JessicaBarh/language-packs
Catalog: extensions/jupyterlab_git/locale/*/LC_MESSAGES/jupyterlab_git.po
Languages: tr_tr

source: Suspend user interaction until commands finish
tr_tr: Komutlar bitene kadar kullanıcı etkileşimini askıya al

# schema
source: Suspend JupyterLab user interaction until Git commands (e.g., commit, pull, reset, revert) finish executing. Setting this to true helps mitigate potential race conditions leading to data loss, conflicts, and a broken Git history. Unless running a slow network, UI suspension should not interfere with standard workflows. Setting this to false allows for actions to trigger multiple concurrent Git actions.
tr_tr: Git komutlarının (ör. commit, pull, reset, revert) yürütülmesi bitene kadar JupyterLab kullanıcı etkileşimini askıya alın. Bunu ‘true’ olarak ayarlamak, veri kaybına, çakışmalara ve bozuk bir Git geçmişine yol açan potansiyel yarış durumlarının azaltılmasına yardımcı olur. Yavaş bir ağ çalıştırılmadığı sürece, kullanıcı arabiriminin askıya alınması standart iş akışlarına müdahale etmemelidir. Bunu ‘false’ olarak ayarlamak, eylemlerin birden çok eşzamanlı Git eylemini tetiklemesine izin verir.

source: Cancel pull merge conflict
tr_tr: Pull merge çakışmasını iptal et

# schema
source: If true, when fetching and integrating changes from a remote repository, a conflicting merge is canceled and the working tree left untouched.
tr_tr: Eğer true seçilirse, uzak bir depodan değişiklikler getirilirken ve entegre edilirken, çakışan bir birleştirme iptal edilir ve çalışma ağacına dokunulmaz.

source: Disable branch with changes
tr_tr: Değişikliklerle dalı devre dışı bırak

# schema
source: Disable all branch operations (new, switch) when there are changed/staged files
tr_tr: Değiştirilen/hazırlanan dosyalar olduğunda tüm dal işlemlerini (yeni, anahtar) devre dışı bırakın

source: Display Git status updates
tr_tr: Git durum güncellemelerini göster

# schema
source: Display Git extension status updates in the JupyterLab status bar. If true, the extension displays status updates in the JupyterLab status bar, such as when pulling and pushing changes, switching branches, and polling for changes. Depending on the level of extension activity, some users may find the status updates distracting. In which case, setting this to false should reduce visual noise.
tr_tr: JupyterLab durum çubuğunda Git uzantısı durum güncellemelerini görüntüleyin. Eğer true ise, uzantı değişiklikleri çekme ve gönderme sırasında, dalları değiştirirken ve değişiklikleri kontrol ederken JupyterLab durum çubuğunda durum güncellemelerini görüntüler. Uzantı etkinliği düzeyine bağlı olarak, bazı kullanıcılar durum güncellemelerini rahatsız edici bulabilir. Bu durumda, bunu yanlış olarak ayarlamak görsel gürültüyü azaltacaktır.

source: Show diff on double click
tr_tr: Çift tıklamayla farklılıkları göster

# schema
source: If true, doubling clicking a file in the list of changed files will open a diff.
tr_tr: Doğruysa, değiştirilen dosyalar listesindeki bir dosyaya çift tıklamak karşılaştırmalı değişiklikleri açacaktır.

source: History count
tr_tr: Geçmiş Sayısı

# schema
source: Number of (most recent) commits shown in the history log
tr_tr: Geçmiş günlüğünde gösterilen (en son) taahhütlerin sayısı

source: Refresh interval
tr_tr: Yenileme aralığı

# schema
source: Number of milliseconds between polling the file system for changes.
tr_tr: Değişiklikler için dosya sistemini sorgulama arasındaki milisaniye sayısı.

# schema
source: jupyterlab-git settings.
tr_tr: jupyterlab-git ayarları.

source: Simple staging flag
tr_tr: Basit evreleme bayrağı

# schema
source: If true, use a simplified concept of staging. Only files with changes are shown (instead of showing staged/changed/untracked), and all files with changes will be automatically staged
tr_tr: Doğruysa, basitleştirilmiş bir evreleme kavramı kullanın. Yalnızca değişiklik içeren dosyalar gösterilir (aşamalı / değiştirilmiş / izlenmemiş olarak göstermek yerine) ve değişiklik içeren tüm dosyalar otomatik olarak hazırlanır
